new Swiper ('.image-slider',{
    // стрілки
    navigation: {
        nextEl: '.swiper-button-next',
        prevEl: '.swiper-button-prev'
    },
    // навігація
    // булети, теперішнє положення, прогресбар - точки, цифри на якій ми зараз фото
    // pagination: {
    //     el: '.swiper-pagination',
    //     /*
    //     // Булети- точки
    //     clickable: true, //для того щоб вони були клікабельні 
    //     // динамічні булети, ефект зменьшення точок при перегортувані слайдів
    //     dynamicBullets: true,
    //     // кастомний булет - наприклад вивисти номер слайда або певні позначки
    //     //чифри в точках
    //     renderBullet: function(index, className) {
    //         return '<span class= "' + className + '">' + (index + 1) + '</span>';
    //     },
    //     */
       
    // //    //фракції - 1/6
    // //    type: 'fraction', // - 1/6
    // //    // кастомний вивід фракції ... фото 1 із 6
    // //    renderFraction: function (currentClass, totalClass) {
    // //        return 'Фото <span class ="' + currentClass + '"></span>' +
    // //        ' із ' + '<span class="' + totalClass + '"></span>';
    // //    },
       
    //    /*
    //   //прогресбар - це лінія яка заповнюється про переходу на інший слайд
    //   type: 'progressbar'
    //   */
    // },

    //Скролл
    // scrollbar: {
    //     el: '.swiper-scrollbar',
    //     // можливість перетягувати скролл
    //     draggable: true
    // },

    //увімкнення\відключуння 
    // перетягуванні на ПК - через картинку
    simulateTouch: true, // - faulse - вимкенться перетягування на пк
    //відчутність свайпа
    touchRadio: 1,
    //градус спрацювання свайпа/ перетягування
    touchAngle: 45,
    //курсор перетягування
    grabCursor: true,

    //переключення слайду на клік по ньому
    slideToClickedSlide: true,

    //навігація по хешу 
    hashNavigation: {
    //відслідковувати позицію
    watchState: true,
    },

    // керування клавіатурою
    keyboard: {
        //включити \ виключити
        enabled: true,
        //включити\ виключити тільки тоді коли склайдер в межах вюпорта
        onlyInViewport: true,  // слайдер переключається боковими клавішами тільки тоді коли ми доскролили до слайдера
        //вкл\викл керування клавіатурою padeUp, padeDown
        pageUpDown: true,
    },

    // //куруванням колесом миші 
    // mousewheel: {
    //     //відчуття колеса миші
    //     sensitivity: 1,
    //     //клас обєкта на якому буде спрацьовувати прокрутка миші
    //     // eventsTarget: ".image-slider"
    // },

    //вирівнювання розміру картинки у слайдері
    // автовисота - висота слайдера плавно підлаштовується під висоту слайдера без зміни фото
    autoHeight: true,

    // кількість слайдерів для показу
    slidesPerView: 1,

    //Відключення функції якщо слайдів меньше чим потрібно у прокрутці показу
    watchOverflow: false,

    // відступи між слайдами
    spaceBetween: 30,

    // кількість пролистування слайдів
    slidesPerGroup: 1,

    // Встановслення активного першого слайду
    // centeredSlides: true,

    // бескінечний слайдер
    // loop: true,

    // свободний режим - свайпаємо без якоїсь фіксації на слайдері
    // freeMode: true,
    /*
    // автопрокрутка
    autoplay: {
        // пауза між прокруткою
        delay: 1000,
        // закінчити на послєдньому слайді
        stopOnLastSlide: true,
        // відключити після ручного переключення 
        disableOnInteraction: false
    },
    */
    // швидкість переключення слайдів
    speed: 500,

    // // вертикальний слайдер - потрібно ще в цсс - задати висобу для блока
    // direction: 'vertical'

    // брейк поінти (адаптив)
    // ширина екрану
    // breakpoints: {
    //     320: {
    //         slidesPerView: 1,
    //     },
    //     480: {
    //         slidesPerView: 2,
    //     },
    //     992: {
    //         slidesPerView: 3,
    //     }
    // }
});
